-- Qualifier to label table
-- please use only quotation marks instead of apostrophs for JSON export

return {
	-- documentation
	moduleInterface = {
		suite  = "VCard",
		sub    = "VCard/Qualifiers",
		serial = "2023-10-29",
		item   = 99929816
	},

	labels = {
		-- Einheiten / units

		gratis    = "無料",
		Q1543615  = "無料",
		Q1092296  = "年",
		Q24564698 = "歳",

		-- Benutzung / use (P366)
		-- 当てはまる部分 (P518) etc.

		Q5070802   = "緊急事態",
		Q11028     = "情報",
		Q1482145   = "電話相談サービス",
		Q256132    = "電話交換機",
		Q2794937   = "受付",
		Q31948     = "ロビー",
		Q862212    = "コンコース",
		Q64883416  = "予約",
		Q2145615   = "テーブル予約", --[[ was merged into ]] Q7673285   = "テーブル予約",
		Q1162163   = "部門長",
		Q267936    = "代表取締役",
		Q25713832  = "指導者",
		Q11964531  = "ゼネラルマネージャー", --[[ was merged into ]] Q1210069   = "ゼネラルマネージャー",
		Q22132694  = "博物館長",
		Q80687     = "秘書",
		Q859482    = "事務局",
		Q182060    = "オフィス",
		Q5283295   = "経営",
		Q50412353  = "運営",
		Q39809     = "マーケティング",
		Q133080    = "PR",
		Q674426    = "キュレーター",
		Q955464    = "主任司祭",
		Q7406919   = "サービス",
		Q1049511   = "WhatsApp",
		Q17517     = "携帯電話",
		
		Q2664461   = "コンシエルジュ",
		Q1735282   = "レジ係",
		Q1463565   = "cash",
		Q551800    = "切符",
		Q187456    = "バー",
		Q777754    = "ケータリング",
		Q41958     = "外食",
		Q171141    = "ガストロノミー",
		Q43164     = "台所",
		Q11707     = "レストラン",
		Q547762    = "エンターテイナー",
		Q133215    = "カジノ",
		Q1065656   = "フィットネスクラブ",
		Q55187     = "美容師",
		Q31374404  = "ショッピングモール",
		Q179415    = "マッサージ",
		Q33506     = "博物館",
		Q1824143   = "宅配", --[[ was merged into ]] Q2334804   = "宅配",
		Q2048970   = "ルームサービス",
		Q15983979  = "遺失物取扱所",
		Q60616546  = "都市観光",
		Q112726458 = "ビザオフィス",

		Q862761    = "内部",
		Q1536931   = "常設展",
		Q29023906  = "展覧会",

		-- gilt für Leute / applies to people (P6001)

		Q5         = "人",
		Q1340307   = "幼児",
		Q7569      = "子ども",
		Q29514218  = "子ども",
		Q190007    = "青年",
		Q131774    = "青年",
		Q170079    = "未成年",
		Q1492760   = "ティーンエイジャー",
		Q17156455  = "若年成人",
		Q80994     = "大人",
		Q18000     = "成人",
		Q16003605  = "小学生",
		Q98021727  = "児童", -- ⎱ These are same Qualifiers
		Q15360275  = "児童", -- ⎰   because these were merged
		Q48942     = "就学児", -- ⎱ These are same Qualifiers
		Q68131879  = "就学児", -- ⎰   because these were merged
		Q37226     = "教員",
		Q48282     = "学生",
		Q315247    = "大学生",
		Q110207241 = "留学生",
		Q253567    = "見習い",
		Q59263364  = "徒弟",
		Q28790169  = "失業者",
		Q59308743  = "生活保護受給者",
		Q109710549 = "連邦ボランティアサービスプロバイダー",
		Q24716636  = "ボランティア",
		Q1930187   = "ジャーナリスト",
		Q1749879   = "年金受給者",
		Q1358789   = "シニア",
		Q111524907 = "60歳以上",
		Q108427775 = "65歳以上",
		Q12131     = "障碍",
		Q15978181  = "障碍者",
		Q1250414   = "重度障碍者",
		Q8436      = "家族",
		Q1422286   = "Begleitperson",
		Q874405    = "社会集団",
		Q16334295  = "集団",
		Q1605672   = "青少年教育者",
		Q113191894 = "エジプト人学生",
		Q113191817 = "アラブ人学生",

		Q221488    = "歩行者",
		Q11442     = "自転車",
		Q42889     = "乗り物",
		Q1420      = "自動車",
		Q1144312   = "乗用車",
		Q43193     = "貨物自動車",
		Q193234    = "スクーター",
		Q34493     = "オートバイ",

		Q23901795  = "正価",
		Q100157294 = "特価",
		Q23901802  = "割引",
		Q10328277  = "半額の入場料",

		Q30079877  = "月間パス",
		Q2024421   = "オンラインチケット",
		Q59582212  = "週間パス",
		Q819073    = "平日",
		Q211391    = "週末",

		Q22947     = "住民",
		Q1020994   = "市民",
		Q473741    = "外国人",
		Q56508363  = "EU/EEAの市民",
		Q56508358  = "EU/EEA外の市民",
		Q1061510   = "エジプト人",
		Q35323     = "アラブ人",
		Q31        = "ベルギー",
		Q4200853   = "インドネシア人",

		Q39201     = "ペット",
		Q144       = "犬",
		Q62966720  = "駐車場所規制",
		Q1039099   = "添乗員",
		Q758877    = "音声ガイド",
		Q15328     = "カメラ",
		Q313600    = "スチールカメラ",
		Q313614    = "ビデオカメラ",
		Q335234    = "カムコーダ",
		Q335095    = "映画用カメラ",
		Q683906    = "三脚"

		-- es fehlen Übernachtung, ÜF, EZ, DZ u. ä. (in Wikidata anlegen)
	}
}