return {
	-- administration
	moduleInterface = {
		suite  = 'UrlCheck',
		serial = '2021-06-02',
		sub    = 'i18n',
		item   = 104199770
	},

	unknown = '不明なエラー',
	 [ 0 ]  = 'エラーは検出されませんでした',
	 [ 1 ]  = 'ホスト名にASCIIコード外の文字があります',
	 [ 2 ]  = 'IPアドレスのホストサーバー',
	 [ 3 ]  = 'URLが空です',
	 [ 4 ]  = 'URLが2048文字以上です',
	 [ 5 ]  = '制御文字かスペースを含むURL',
	 [ 6 ]  = 'プロトコルが欠落または誤っています',
	 [ 7 ]  = 'ホスト名がスラッシュで始まっています',
	 [ 8 ]  = 'ホスト名に無効な文字の組み合わせが含まれています',
	 [ 9 ]  = '1つ以上のアットマークが見つかりました',
	[ 10 ]  = 'ユーザーまたはホストのないアットマークが検出されました',
	[ 11 ]  = 'ユーザー名に2つ以上のコロンが含まれています',
	[ 12 ]  = 'ユーザー名やホストのないコロンが検出されました',
	[ 13 ]  = 'ユーザー名が64文字を超えています',
	[ 14 ]  = 'ホスト名が空です',
	[ 15 ]  = 'ホスト名の中に2つ以上のコロンが検出されました',
	[ 16 ]  = 'ホストやポートのないコロンが検出されました',
	[ 17 ]  = '0から65535の範囲にないポート番号',
	[ 18 ]  = '253文字を超えたホスト名',
	[ 19 ]  = 'ドメイン名を区切るドットがないホスト',
	[ 20 ]  = 'ポイントはあるがトップレベルドメインがないホスト名',
	[ 21 ]  = '不明なトップレベルドメイン',
	[ 22 ]  = '無効なホスト構造',
	[ 23 ]  = '無効なパス構造'
}